Revit 2027 API
FamilyManager.RenameCurrentType Method
Rename the current family type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RenameCurrentType(
	string typeName
)
Public Sub RenameCurrentType (
	typeName As String
)
public:
void RenameCurrentType(
	String^ typeName
)
member RenameCurrentType :
        typeName : string -> unit
Parameters
typeName String
The new name of the current family type.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"typeName"-is null.
ArgumentException |  Thrown when the input argument-"typeName"-is already in use.
InvalidOperationException |  Thrown when the family type rename failed.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace